PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    CAN_Type * const pDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pDeviceConfig = &cdr_canDriverConfig[idxCanDevice];

    if(isExtId && (canId & 0xe0000000u) != 0  ||  !isExtId && (canId & 0xfffff800u) != 0)
        return cdr_errApi_badCanId;

    /* With enabled FIFO, the first mailboxes are not in normal operation and the
       configuration differs.
         The message handle space for the client code appends the normal mailboxes to the
       FIFO filter entries. */
    const unsigned int noFIFOMsgs = cdr_getNoFIFOFilterEntries(pDeviceConfig)
                     , idxFirstNormalMailbox = cdr_getIdxOfFirstMailbox(pDeviceConfig);
    if(hMsg < noFIFOMsgs)
    {
        /* The reservation addresses to a FIFO Rx mailbox. Tx is forbidden and a
           notification request is essential, since FIFO mailboxes can't be read by
           polling. */

        /* Msg is identical to the index of the FIFO filter table entries. */
        const unsigned int idxFilterEntry = hMsg;

        if(!isReceived)
            return cdr_errApi_fifoMailboxUsedForTx;
        if(!doNotify)
            return cdr_errApi_fifoMailboxRequiresNotification;

        /* Check if the same mailbox had been requested already in an earlier function
           call. Although it would be technically possible to reconfigure a mailbox in a
           repeated call, it is nearly certain that this rather points to an error in the
           client code. This is why we don't allow it. */
        uint32_t const rxFilterBefore = *getFIFOFilterEntry(pDevice, idxFilterEntry);
        if(rxFilterBefore != (CAN_FIFOFILTER_RTR(1)
                              | CAN_FIFOFILTER_IDE(1)
                              | CAN_FIFOFILTER_RXIDA_EXT(0x1fffffffu)
                             )
          )
        {
            return cdr_errApi_mailboxReconfigured;
        }

        uint32_t const rxFilter = CAN_FIFOFILTER_RTR(0)
                                  | (isExtId
                                     ? (CAN_FIFOFILTER_IDE(1u)|CAN_FIFOFILTER_RXIDA_EXT(canId))
                                     : (CAN_FIFOFILTER_IDE(0u)|CAN_FIFOFILTER_RXIDA_STD(canId))
                                    );
        *getFIFOFilterEntry(pDevice, idxFilterEntry) = rxFilter;
    }
    else if(hMsg + idxFirstNormalMailbox < noFIFOMsgs + pDeviceConfig->noMailboxes)
    {
        /* A normal mailbox is reserved. */

        /* hMsg needs a simple transformation to become the index of the mailboxes in the
           device. */
        const unsigned int idxMB = hMsg + idxFirstNormalMailbox - noFIFOMsgs;
        assert(idxMB < pDeviceConfig->noMailboxes);

        volatile cdr_mailbox_t * const pMB = cdr_getMailbox(pDevice, idxMB);

        if((pMB->csWord & (CAN_MBCS_CODE_MASK | CAN_MBCS_IDE_MASK)) != 0)
            return cdr_errApi_mailboxReconfigured;

        /* Check if demand for notification is plausible with respect to the driver
           configuration. Macro #CHECK_GROUP_IRQ returns true if there's no implausibility
           for IRQ group [from, to].
             (int)idxMB: The type cast in the condition has no impact on the result of the
           possible decisions but hinders the compiler from issuing a warning becasue of
           otherwise comparing an unsigned value on greater or equal to zero (always true,
           -Wtype-limits). */
        #define CHECK_GROUP_IRQ(from, to)                                               \
                (!((int)idxMB >= (from)  &&  idxMB <= (to))                             \
                 || (pDeviceConfig->irqGroupMB##from##_##to##IrqPrio > 0                \
                     && (isReceived? pDeviceConfig->osCallbackOnRx != NULL              \
                                   : pDeviceConfig->osCallbackOnTx != NULL              \
                        )                                                               \
                    )                                                                   \
                )
        if(doNotify
           && (!CHECK_GROUP_IRQ(0, 3)
               || !CHECK_GROUP_IRQ(4, 7)
               || !CHECK_GROUP_IRQ(8, 11)
               || !CHECK_GROUP_IRQ(12, 15)
               || !CHECK_GROUP_IRQ(16, 31)
               || !CHECK_GROUP_IRQ(32, 63)
               || !CHECK_GROUP_IRQ(64, 95)
              )
          )
        {
            return cdr_errApi_notificationWithoutIRQ;
        }
        #undef CHECK_GROUP_IRQ

        /* Clear a possibly pending interrupt bit (RM 43.4.12/13/21, p. 1735ff) and enable
           the interrupt for the given mailbox (RM 43.4.11/10/20). */
        if(idxMB < 32)
        {
            const uint32_t mask = 1u << idxMB;
            pDevice->IFLAG1 =  mask; /* Clear IRQ bit by "w1c". */
            if(doNotify)
                pDevice->IMASK1 |= mask; /* Set IRQ enable bit. */
            else
                assert((pDevice->IMASK1 & mask) == 0);
        }
        else if(idxMB < 64)
        {
            const uint32_t mask = 1u << (idxMB-32u);
            pDevice->IFLAG2 =  mask; /* Clear IRQ bit by "w1c". */
            if(doNotify)
                pDevice->IMASK2 |= mask; /* Set IRQ enable bit. */
            else
                assert((pDevice->IMASK2 & mask) == 0);
        }
        else
        {
            assert(idxMB < 96);
            const uint32_t mask = 1u << (idxMB-64u);
            pDevice->IFLAG3 =  mask; /* Clear IRQ bit by "w1c". */
            if(doNotify)
                pDevice->IMASK3 |= mask; /* Set IRQ enable bit. */
            else
                assert((pDevice->IMASK3 & mask) == 0);
        }

        const unsigned int CODE = isReceived
                                  ? 4   /* 0, EMPTY, makes it an empty, enabled Rx mailbox */
                                  : 8   /* 0, INACTIVE, makes it an empty, enable Tx mailbox */
                                  ;

        /* See RM 43.4.40, p. 1771, for the fields of the mailbox. See Table 43-8, p.
           1772ff, for the Rx mailbox status and command CODEs. */
        pMB->csWord = CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                      | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                      | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                      | CAN_MBCS_CODE(CODE)
                      | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                      | CAN_MBCS_IDE(isExtId? 1u: 0u)/* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                      | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                      | CAN_MBCS_DLC(TxDLC) /* Size of frame, doesn't care for Rx. */
                      | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care is set on transmission */
                      ;
        pMB->canId = CAN_MBID_PRIO(0u)   /* We don't use the local prio value. */
                     | (isExtId? CAN_MBID_ID_EXT(canId): CAN_MBID_ID_STD(canId));
    }
    else
        return cdr_errApi_idxMailboxOutOfRange;

    return cdr_errApi_noError;

} /* End of cdr_osMakeMailboxReservation. */



/**
 * Comman part of the two APIs to send a Tx message. It checks the mailbox state and
 * prepares it for sending. It does not copy the payload and it doesn't trigger sending
 * yet.
 *   @return
 * The pointer to the affected mailbox if function succeeds, else \a NULL. The latter can
 * happen, if the buffer in the hardware is still occupied by the preceeding message, which
 * has not yet serialized on the CAN bus.\n
 *   If the function returns \a NULL then the caller must not proceed with sending.
 *   @param idxCanDevice
 * The affected CAN device (see enumeration \a cdr_canDevice_t).
 *   @param hMsg
 * The message to send is identified by the handle.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message. This function can be used to implement a send queue: If it returns \a
 * false then the message is appended to the queue. The notification callback checks the
 * queue and sends the heading element - if any - using this function.
 *   @todo
 * The use case "queued sending" would be better supported by a second variant of this
 * function, which offered to specify the CAN ID (and std/ext) in each call. The basic
 * function would then no longer offer DLC: Either most simple for typical mailbox patterns
 * or full flexibility with maximum overhead.
 */
static volatile cdr_mailbox_t *osPrepareSendMessage( unsigned int idxCanDevice
                                                   , unsigned int hMsg
                                                   )
{
    /* A pointer to the device in operation and its configuration is basis of the next
       steps. */
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    CAN_Type * const pDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pDeviceConfig = &cdr_canDriverConfig[idxCanDevice];

    /* Tx is only possible with normal mailboxes. */
    const unsigned int noFIFOMsgs = cdr_getNoFIFOFilterEntries(pDeviceConfig)
                     , idxFirstNormalMailbox = cdr_getIdxOfFirstMailbox(pDeviceConfig);
    assert(hMsg >= noFIFOMsgs);

    /* hMsg needs a simple transformation to become the index of the mailboxes in the
       device. */
    const unsigned int idxMB = hMsg + idxFirstNormalMailbox - noFIFOMsgs;
    assert(idxMB < pDeviceConfig->noMailboxes);

    /* Get the pointer to the mailbox in use. */
    volatile cdr_mailbox_t * const pTxMB = cdr_getMailbox(pDevice, idxMB);

    /* Read status word of MB and decide whether we may send (already again). */
    const uint32_t csWord = pTxMB->csWord
                 , CODE = (csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
    if(CODE == 8 /* TX ACTIVE */)
    {
        /* The MB is basically free. There's still an important consideration. Sending may
           be done with or without IRQ notification and in either case we need to
           acknowledge the interrupt from the preceeding Tx - otherwise the MB is blocked
           (RM 43.5.1, p. 1789). If notification is enabled then there are possible race
           conditions: Will the ISR or do we here reset the flag?
             The normal usecase of Tx notifications is virtualization of MBs by buffering:
           The application code interface sends by putting the messge in a SW buffer only.
           On each Tx notification from the CAN driver, the next element from the buffer is
           passed on to the driver, i.e. to this function. In this use case, the
           notifiocation IRQ will always come prior to the next call of this function and
           so the interrupt is already negated on entry into this function.
             Consequently, if we unconditionally negate the flag here, then we either do,
           what we need to do (if no Tx notification is configured) or what is useless but
           doesn't do any harm (if no Tx notification is configured and already negated the
           flag). */

