PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
        /* Unconditionally clear a possibly pending interrupt bit (RM 43.4.12/13/21, p.
           1735ff) and thereby unlock the mailbox. */
        if(idxMB < 32)
        {
            const uint32_t mask = 1u << idxMB;
            pDevice->IFLAG1 =  mask; /* Clear IRQ bit by "w1c". */
        }
        else if(idxMB < 64)
        {
            const uint32_t mask = 1u << (idxMB-32u);
            pDevice->IFLAG2 =  mask; /* Clear IRQ bit by "w1c". */
        }
        else
        {
            assert(idxMB < 96);
            const uint32_t mask = 1u << (idxMB-64u);
            pDevice->IFLAG3 =  mask; /* Clear IRQ bit by "w1c". */
        }

        /* Sending is possible, return mailbox for completion of operation. */
        return pTxMB;
    }
    else
    {
        /* Mailbox is still busy. Nothing can be done. */
        return NULL;
    }
} /* End of osPrepareSendMessage */




/**
 * Send a Tx message. This API (as opposed to cdr_osSendMessageEx()) for the simple but
 * common use case where each CAN ID is connected to one particular mailbox (or message
 * handle).\n
 *   "Sending" means placing it into the mailbox, i.e. the reserved buffer
 * in the CAN device hardware. The hardware decides autonomously, when the buffer is
 * serialized on the CAN bus. Usually, this will happen much later then the return from
 * this function. (An interrupt can be configured to get a notification when it is
 * completed. See cdr_osMakeMailboxReservation() for details.)
 *   @return
 * \a true, if function succeeded, else \a false. The latter can happen, if the buffer in
 * the hardware is still occupied by the preceeding message, which has not yet serialized
 * on the CAN bus.\n
 *   If the function returns \a false then it had no effect.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * device. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_canDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is caught by assertion.
 *   @param hMsg
 * The message to send is identified by the handle. Any message can be send only if it had
 * been associated with a mailbox in the hardware, i.e. a successful call of
 * cdr_osMakeMailboxReservation() is prerequisite of using this function. The handle to use
 * here is the same as used when having done the related call of
 * cdr_osMakeMailboxReservation(). An out of range situation is caught by assertion.
 *   @param payload
 * The message content bytes to sent. The number of bytes to send is taken from the current
 * mailbox configuration. Normally, it'll be the never changed value aggreed on during the
 * reservation of the mailbox (see cdr_osMakeMailboxReservation()). However, if the
 * extended send API cdr_osSendMessageEx() is used alternatingly with this simple API then
 * the DLC will be applied, which had been set with the last recent call of the extended API.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message.
 *   @remark
 * This API and cdr_osSendMessageEx() are alternatives. They access the same hardware and
 * have heavy race conditions. They must never be used at a time for one and the same
 * mailbox. Most use cases will lead to a general either or in the client code but the
 * non-overlapping over time, alternating use is permitted, too.
 */
bool cdr_osSendMessage( unsigned int idxCanDevice
                      , unsigned int hMsg
                      , const uint8_t payload[]
                      )
{
    /* Check and prepare the mailbox to be used and get the pointer to it. */
    volatile cdr_mailbox_t * const pTxMB = osPrepareSendMessage(idxCanDevice, hMsg);

    /* Complete send operation if preparation reports success. */
    if(pTxMB != NULL)
    {
        /* Read the status word of the mailbox. */
        const uint32_t csWord = pTxMB->csWord;

        /* Copy sent data into the mailbox. */
        const unsigned int DLC = (csWord & CAN_MBCS_DLC_MASK) >> CAN_MBCS_DLC_SHIFT;
        assert(DLC <= 8);
        memcpy((void*)&pTxMB->payload[0], payload, DLC);

        /* Changeing the C/S word in the MB initiates the transmission. See RM, Table 43-9, p.
           1775, for the Tx mailbox status and command CODEs.
             A read-modify-write is required as we must not alter the bit IDE. */
        pTxMB->csWord = csWord | CAN_MBCS_CODE(12); /* CODE doesn't need masking: 8->12 */

        /* Sending is successfully initiated. */
        return true;
    }
    else
    {
        /* Mailbox is still busy. Nothing to be done. */
        return false;
    }
} /* End of cdr_osSendMessage */



/**
 * Send a Tx message. This API (as opposed to cdr_osSendMessage()) may be used if one and
 * the same mailbox is applied to transmit messages of variable length or with varying CAN
 * ID.\n
 *   "Sending" means placing it into the mailbox, i.e. the reserved buffer
 * in the CAN device hardware. The hardware decides autonomously, when the buffer is
 * serialized on the CAN bus. Usually, this will happen much later then the return from
 * this function. (An interrupt can be configured to get a notification when it is
 * completed. See cdr_osMakeMailboxReservation() for details.)
 *   @return
 * \a true, if function succeeded, else \a false. The latter can happen, if the buffer in
 * the hardware is still occupied by the preceeding message, which has not yet serialized
 * on the CAN bus.\n
 *   If the function returns \a false then it had no effect.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * device. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_canDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is caught by assertion.
 *   @param hMsg
 * The message to send is identified by the handle. Any message can be send only if it had
 * been associated with a mailbox in the hardware, i.e. a successful call of
 * cdr_osMakeMailboxReservation() is prerequisite of using this function. The handle to use
 * here is the same as used when having done the related call of
 * cdr_osMakeMailboxReservation(). An out of range situation is caught by assertion.
 *   @param isExtId
 * Standard and extended CAN IDs partly share the same space of numbers. Hence, we need the
 * additional Boolean information, which of the two the ID \a canId belongs to.
 *   @param canId
 * The standard or extended ID of the CAN message to send. See \a isExtId, too.
 *   @param DLC
 * The number of bytes to send in the range 0..8. An out of range situation is caught by
 * assertion.
 *   @param payload
 * The \a DLC message content bytes, which are sent.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message. This function can be used to implement a send queue: If it returns \a
 * false then the message is appended to the queue. The notification callback checks the
 * queue and sends the heading element - if any - using this function.
 *   @remark
 * This API and cdr_osSendMessage() are alternatives. They access the same hardware and
 * have heavy race conditions. They must never be used at a time for one and the same
 * mailbox. Most use cases will lead to a general either or in the client code but the
 * non-overlapping over time, alternating use is permitted, too.
 */
bool cdr_osSendMessageEx( unsigned int idxCanDevice
                        , unsigned int hMsg
                        , bool isExtId
                        , unsigned int canId
                        , unsigned int DLC
                        , const uint8_t payload[]
                        )
{
    /* Check and prepare the mailbox to be used and get the pointer to it. */
    volatile cdr_mailbox_t * const pTxMB = osPrepareSendMessage(idxCanDevice, hMsg);

    /* Complete send operation if preparation reports success. */
    if(pTxMB != NULL)
    {
        /* Setthe CAN ID to be used this time with the mailbox. */
        pTxMB->canId = CAN_MBID_PRIO(0u)   /* We don't use the local prio value. */
                       | (isExtId? CAN_MBID_ID_EXT(canId): CAN_MBID_ID_STD(canId));

        /* Copy sent data into the mailbox. */
        assert(DLC <= 8);
        memcpy((void*)&pTxMB->payload[0], payload, DLC);

        /* Changeing the C/S word in the MB initiates the transmission. See RM, Table 43-9, p.
           1775, for the Tx mailbox status and command CODEs. */
        pTxMB->csWord =
                CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                | CAN_MBCS_CODE(12)   /* 12, DATA, triggers Tx. */
                | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                | CAN_MBCS_IDE(isExtId? 1: 0) /* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                | CAN_MBCS_DLC(DLC) /* no FD: n=no bytes, FD: see RM, Table 43-10, p. 1777. */
                | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care if set on transmission */
                ;

        /* Sending is successfully initiated. */
        return true;
    }
    else
    {
        /* Mailbox is still busy. Nothing to be done. */
        return false;
    }
} /* End of cdr_osSendMessageEx */



