PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
void cdr_osTestRxTx_init(cdr_canDevice_t canDevice)
{
//  if(u==25) /* Initial Rx test */
//  {
//      /* See RM 43.4.40, p. 1771, for the fields of the mailbox. See Table 43-8, p.
//         1772ff, for the Rx mailbox status and command CODEs. */
//      pMB->csWord = CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
//                    | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
//                    | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
//                    | CAN_MBCS_CODE(4)/* 0, EMPTY, makes it an empty, enabled Rx mailbox */
//                    | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
//                    | CAN_MBCS_IDE(0) /* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
//                    | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
//                    | CAN_MBCS_DLC(0) /* Size of frame, doesn't care for Rx. */
//                    | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care is set on transmission */
//                    ;
//      pMB->canId = CAN_MBID_PRIO(0)   /* We don't use the local prio value. */
//                   | CAN_MBID_ID_STD(0x80)  /* Standard CAN ID 128 enabled for Rx. */
//                   ;
//  }

    cdr_errorAPI_t err;

    /* Register outbound message 0x7f in the first normal mailbox. */
#define H_MSG_CAN_ID_0X7F   72
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ H_MSG_CAN_ID_0X7F
                                      , /* isExtId */ false
                                      , /* canId */ 0x7f
                                      , /* isReceived */ false
                                      , /* TxDLC */ 8
                                      , /* doNotify */ false
                                      );
    assert(err == cdr_errApi_noError);

    /* Register Rx test message 0x80 in the second normal mailbox for polling. */
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 73
                                      , /* isExtId */ false
                                      , /* canId */ 0x80
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ false
                                      );
    assert(err == cdr_errApi_noError);

    /* Register some FIFO Rx messages. */
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 0
                                      , /* isExtId */ false
                                      , /* canId */ 0x81
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 1
                                      , /* isExtId */ false
                                      , /* canId */ 0x82
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 2
                                      , /* isExtId */ false
                                      , /* canId */ 0x83
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 71
                                      , /* isExtId */ false
                                      , /* canId */ 0x7ff
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);

//    *getFIFOFilterEntry(pCanDevice, 0) = CAN_FIFOFILTER_IDE(0)
//                                         | CAN_FIFOFILTER_RXIDA_STD(0x81);
//    *getFIFOFilterEntry(pCanDevice, 1) = CAN_FIFOFILTER_IDE(0)
//                                         | CAN_FIFOFILTER_RXIDA_STD(0x82);
//    *getFIFOFilterEntry(pCanDevice, 2) = CAN_FIFOFILTER_IDE(0)
//                                         | CAN_FIFOFILTER_RXIDA_STD(0x83);
//    *getFIFOFilterEntry(pCanDevice, 71) = CAN_FIFOFILTER_IDE(0)
//                                          | CAN_FIFOFILTER_RXIDA_STD(0x7ff);

    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 4
                                      , /* isExtId */ true
                                      , /* canId */ 0x81
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 23
                                      , /* isExtId */ true
                                      , /* canId */ 0x82
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 25
                                      , /* isExtId */ true
                                      , /* canId */ 0x83
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);
    err = cdr_osMakeMailboxReservation( canDevice
                                      , /* hMsg */ 70
                                      , /* isExtId */ true
                                      , /* canId */ 0x7ff
                                      , /* isReceived */ true
                                      , /* TxDLC */ 0 /* value doesn't care for Rx */
                                      , /* doNotify */ true
                                      );
    assert(err == cdr_errApi_noError);

//    *getFIFOFilterEntry(pCanDevice, 4) = CAN_FIFOFILTER_IDE(1)
//                                         | CAN_FIFOFILTER_RXIDA_EXT(0x81);
//    *getFIFOFilterEntry(pCanDevice, 23) = CAN_FIFOFILTER_IDE(1)
//                                          | CAN_FIFOFILTER_RXIDA_EXT(0x82);
//    *getFIFOFilterEntry(pCanDevice, 25) = CAN_FIFOFILTER_IDE(1)
//                                          | CAN_FIFOFILTER_RXIDA_EXT(0x83);
//    *getFIFOFilterEntry(pCanDevice, 70) = CAN_FIFOFILTER_IDE(1)
//                                          | CAN_FIFOFILTER_RXIDA_EXT(0x7ff);

} /* cdr_osTestRxTx_init */



/* RM 43.4.9, p. 1727: The error word CAN_ESR1 is related to the last recently received
   message but the bits are sticky. If the status is read by the CPU then they are reset
   otherwise they are held. So the CPU should read the word on each Rx event and relate the
   bits to the received message.
     Careful: The bits are obviously meant to be read by interrupt (which is caused by
   them). Both at a time is impossible due to the reset-on-read and we tend to offer the
   interrupt. */

/// @todo Configure a Tx mailbox and try sending regularly. Then configure Rx MB (no IRQ)
/// and try reception by polling. Then try MB IRQs
void cdr_osTestRxTx_task10ms(cdr_canDevice_t canDevice)
{
    /* Make an integer from the zero based device enumeration. */
    const unsigned idxCanDevice = (unsigned)canDevice;

    static uint16_t SBSS_OS(cnt_) = 0;
    ++ cnt_;

    /* Initial test: Send a message every 10ms. */
    assert((unsigned)idxCanDevice == 0);

    /// @todo TBC: Do we need to initialize a mailbox for TX by setting CODE to INACTIVE (8)?
    /* A pointer to the device in operation and its configuration is basis of the next
       steps. */
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    CAN_Type * const pDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pCanDevConfig = &cdr_canDriverConfig[idxCanDevice];

    /* Get the pointer to the mailbox in use: We take the first one behind the FIFO. */
    const unsigned int idxFirstMB = 8u + 2u*pCanDevConfig->CTRL2_RFFN
                     , idxRxMB = idxFirstMB + 1;
    assert(idxFirstMB == 24);
    volatile cdr_mailbox_t * const pRxMB = cdr_getMailbox(pDevice, idxRxMB);

    static unsigned int SDATA_OS(noRxEvent_) = 0;
    static unsigned int SDATA_OS(noTxErr_) = 0;

    /* Fill data in the mailbox. */
    static union
    {
        uint8_t payload[8];
        uint16_t payload_u16[4];
        uint32_t payload_u32[2];

    } payload_ = { .payload_u32 = {[0] = 0, [1] = 0} };
    payload_.payload_u16[2] = (uint16_t)(noRxEvent_ & 0x0000ffffu);
    payload_.payload_u16[3] = cnt_;
    payload_.payload[3] = (uint8_t)(noTxErr_ & 0x000000ffu);

