PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    /* Send the message. We try both alternative APIs. One of them permits using the
       mailbox for different DLC and CAN Id, too.*/
    if((cnt_ & 0x70) != 0)
    {
        /* Most of the time we use the simple API. */
        if(!cdr_osSendMessage( /* idxCanDevice */ cdr_canDev_CAN_0
                             , /* hMsg */ H_MSG_CAN_ID_0X7F
                             , &payload_.payload[0]
                             )
          )
        {
            ++ noTxErr_;
        }
    }
    else
    {
        /* From time to time we use the extended API. DLC and CAN ID are chosen such that
           they end with 8 or 127, respectively before we switch back to the simple API -
           which continues with these values. */ 
        unsigned int DLC = ((cnt_ & 0xfu)+1u) / 2u
                   , canId = 127u - 8u + DLC;
        bool isExtId = canId <= 125;
        if(!cdr_osSendMessageEx( /* idxCanDevice */ cdr_canDev_CAN_0
                               , /* hMsg */ H_MSG_CAN_ID_0X7F
                               , isExtId
                               , canId
                               , DLC
                               , &payload_.payload[0]
                               )
          )
        {
            ++ noTxErr_;
        }
        
    }
    
    
    /* Poll for newly received input. */
    assert(idxRxMB < 32); /* Mailbox associated with right flag register? */
    const uint32_t irqMaskRx = 1u << idxRxMB;
    if((pDevice->IFLAG1 & irqMaskRx) != 0)
    {
        ++ noRxEvent_;

        const uint32_t CODE = (pRxMB->csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
        assert(CODE == 2 /* FULL */  ||  CODE == 6 /* OVERRUN */);
        const uint32_t DLC = (pRxMB->csWord & CAN_MBCS_DLC_MASK) >> CAN_MBCS_DLC_SHIFT;

        /* Copy first received bytes into Tx test message. 3 Bytes are left. */
        unsigned int u;
        for(u=0; u<3 && u<DLC; ++u)
            payload_.payload[u] = pRxMB->payload[u];

        /* Acknwoledge the IRQ. */
        /// @todo Find out, whether the order of IRQ ack. and MB unlock by reading timer matters
        pDevice->IFLAG1 = irqMaskRx; /* Clear bit by "w1c" */

        /* RM 43.4.4, p. 1721f: Read the timer register to unlock theevaluated mailbox
           (side-effect of reading). See 43.5.7.3 Mailbox lock mechanism, p. 1808ff for
           more details. */
        (void)pDevice->TIMER;
    }
} /* cdr_testSend_task10ms */


